app/controllers/api/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "panda.bear@anco.com"], ["LIMIT", 1]]
---
  def check_email

    @user = User.find_by(email: params[:user][:email])