app/controllers/api/tracks_controller.rb

    def index
        # @tracks = Track.find_by(author_id: params[:author_id])
        @tracks = Track.all
---
SELECT "tracks".* FROM "tracks"

    def show
        @track = Track.find_by(id:params[:id])
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def create
        @track = Track.new(track_params)
        if @track.save
---
INSERT INTO "tracks" ("title", "desc", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "this is a test"], ["desc", "kasjdakjd"], ["author_id", 2], ["created_at", "2019-06-06 20:53:42.235211"], ["updated_at", "2019-06-06 20:53:42.235211"]]

    def update
        @track = Track.find_by(id: params[:id])
        if (@track && @track.update_attributes(track_params))
---
UPDATE "tracks" SET "updated_at" = $1 WHERE "tracks"."id" = $2  [["updated_at", "2019-06-07 10:00:56.691081"], ["id", 37]]