app/views/api/tracks/_track.json.jbuilder

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    json.extract! track, :id, :title, :author_id, :created_at
    json.author (User.all.find(track.author_id)).username